# # #შემოგდით სია, გამოიტანეთ ამ სიაში პირველი და მეორე უდიდესი რიცვების ჯამი.

# # # test cases: 
# # 1) შესატანი მონაცემები: [1, 4, 5, 20, 3, 2] 
# # -> გამოსატანი მონაცემები:25 
# # 2) შესატანი მონაცემები: [5, 9, 10, 40, 12, 3]  
# # -> გამოსატანი მონაცემები: 52 
# # 3) შესატანი მონაცემები: [80, 70, 40, 20] 
# # -> გამოსატანი მონაცემები: 150

# # num = [1, 4, 5, 20, 3, 2] 
# # a = max(num)
# # num.remove(max(num))
# # b = max(num)

# # print(a + b)


# # num = [5, 9, 10, 40, 12, 3]   
# # a = max(num)
# # num.remove(max(num))
# # b = max(num)

# # print(a + b)

# # num = [80, 70, 40, 20]   
# # a = max(num)
# # num.remove(max(num))
# # b = max(num)

# # print(a + b)



# # შემოგდით ორი რიხვი, 
# # გამოიტანეთ უმცირესი ისეთი რიცხვი რომელიც ორივეზე იყოფა.
# # word 

# # test cases:
# #  1) შესატანი მონაცემები: 6 10 
# # -> გამოსატანი მონაცემები: 30 
# # 2) შესატანი მონაცემები: 16 4
# # -> გამოსატანი მონაცემები: 32

# a = 6
# b = 10

# if a>b:
#     i = a
# elif b>a:
#     i = b


# while i % a != 0 or i % b != 0:
#     i+=1
# print(i)


# მათეს დნმ შედგება ოთხი ასოსგან - M,A,T,E.
#  მათეს გუშინ მოუწია ჩერნობილში წასვლა და დნმ შეეცვალა. 
# ის მუტაციას განიცდის თუ: 
# 1.მათეს დნმში ასოების ნახევარზე მეტი არ ემთვევა;
# 2. მათეს დნმში სხვა ასოებია. შემოგდით ორი სტრიქონი, 
# დნმი ჩერნობილამდე და დნმ შემდეგ, 
# გამოიტანეთ მუტაცია განიცადა თუ არა მათე (YES,NO)

# test cases: 
# 1) შესატანი მონაცემები: "MATTATEA" "MTATAEEE" 
# -> გამოსატანი მონაცემები: "NO" 
# 2) შესატანი მონაცემები: "MATEEEEE" "BATEEEEE" 
# -> გამოსატანი მონაცემები: "YES"

# DNMset = {"M","A","T","E"}
# set1 = {"M","A","T","T","A","T","E","A"}
# set2 = {"M", "T", "A", "T", "A", "E", "E", "E"}

# i = DNMset.intersection(set1 and set2)
# print(i)
# if i == DNMset:
#     print("no")
# else:
#     print("yes")

# set3 = {"M","A","T","E","E","E","E","E"}
# set4 = {"B","A","T","E","E","E","E","E"}

# i = DNMset.intersection(set3 and set4)
# print(i)
# if i == DNMset:
#     print("no")
# else:
#     print("yes")



'''ტყეშელა შევიდა სახინკლეში და უნდოდა n ხინკალი. 
მიმტანს ქონდა თეფშები რომლებზეც დევს ხინკლები
(თეფშები სიადაა მოცემული). 
თეფშებიდან არ შეუძლია მომტანს ხინკლების აღება. 
ტყეშელას არუნდა თეფშებით მაგიდა გაევსოს და აინტერესებს 
რა მინიმალური რაოდენობის თეფში არის საჭირო რომ რამდენი 
ხინკალიც უნდა იმდენი მაინც მიუტანოს მიმტანმა. 
შემოგდით რიცხვი n და სია, 
რამდენი ხინკალი უნდა ტყეშელას და თეფშებზე რამდენი ხინკალი დევს, 
გამოიტანეთ რამდენი თეფშის მიტანაა საჭირო ტყეშელასთან 
(თუ შეუძლებელია False).
'''

'''test cases: 1) 
შესატანი მონაცემები: 15 [1,5,4,4,3,3,5,3,4] 
-> გამოსატანი მონაცემები: 4 2) შესატანი მონაცემები: 
34 [1,4,8,3,5,3,4] გამოსატანი მონაცემები: False
'''
list[1,5,4,4,3,3,5,3,4]
def minimaluri_xinkalis_tefshi(s,list):
    sum = 0
    for i, element in (list):
        sum+=element
        if sum>=s:
            return i
print()