# 1 ამოცანები

# 1. მოცემულია რიცხვითი მასივი და მოცემულია ცალკე კიდევ ერ-
# თი რიცხვი. იპოვეთ არის თუ არა მასივში ორი რიცხვი, რომელ-
# თა ჯამი ეს ცალკე მოცემული მნიშვნელობაა.

# (a) მიამიტი სიჩქარით O(n
# 2
# ), მეხსიერებით O(1)
# (b) სორტირებით სიჩქარით O(n log n), მეხსიერებით O(1)
# (c) ჰეშ სიმრავლეებით სიჩქარით O(n), მეხსიერებით O(n)

# 2. მოცემულია n+2 რიცხვისგან შექმნილი მასივი, რომელთა მნიშ-
# ვნელობები არის დიაპაზონში 1-დან n-მდე. ყველა რიცხვი გან-
# სხვავებულია გარდა ორი რიცხვისა, რომლებიც მეორდებიან.

# იპოვეთ ეს რიცხვები
# (a) მიამიტი: სიჩქარით O(n
# 2
# ), მეხსიერებით O(1)

# (b) დამატებითი მასივით: სიჩქარით O(n), მეხსიერებით O(n)
# (c) მეთემატიკით ან/და სხვადასხვა ხრიკებით: სიჩქარით O(n),
# მეხსიერებით O(1)
# (d) სორტირებით: სიჩქარით O(n log n), მეხსიერებით O(1)
# 3. მოცემული რიცხვითი მასივისთვის იპოვეთ უწყვეტი ქვემასივი
# ელემენტების ჯამის მაქსიმუმით.
# (a) მიამიტი: სიჩქარით O(n
# 2
# ), მეხსიერებით O(1)

# (b) დინამიური პროგრამირება კადანეს ალგორითმი სიჩქარით
# O(n), მეხსიერებით O(1)

# 4. მოცემულ სტრიქონში იპოვეთ ისეთი ყველაზე გრძელი ქვესტრი-
# ქონი, რომელშიც სიმბოლოები არ მეორდება.

# (a) მიამიტი: სიჩქარით O(n
# 2
# ), მეხსიერებით O(1)
# (b) მცურავი ფანჯრით სიჩქარით O(n), მეხსიერებით O(1)
# 5. ორი მოცემული სტრიქონისთვის შეამოწმეთ შედგებიან თუ არა
# ისინი ერთი და იგივე სიმბოლოებისგან
# (a) მიამიტი: სიჩქარით O(n log n)+O(m log m), მეხსიერებით O(1)
# (b) სიხშირეების დათვლით სიჩქარით O(n + m), მეხსიერებით
# O(1)

# 6. მთელი რიცხვის ორობით წარმოდგენაში იპოვეთ 1-იანების რა-
# ოდენობა

# 1

# (a) რეკურსია სიჩქარით O(log n), მეხსიერებით O(log n)
# (b) ლუქაფ თეიბლით სიჩქარით O(log n), მეხსიერებით O(log n)
# (c) გადათვლით სიჩქარით O(log n), მეხსიერებით O(1)

# 7. მოცემული რიცხვითი მასივისთვის იპოვეთ ქვემასივი ელემენ-
# ტების ნამრავლის მაქსიმუმით.

# (a) მიამიტი: სიჩქარით O(n
# 2
# ), მეხსიერებით O(1)
# (b) ხრიკები: სიჩქარით O(n), მეხსიერებით O(1)
# 8. მოცემული ინტერვალების სიმრავლისთვის ამოყარეთ ისეთი

# ინტერვალები, რომლებიც სხვა ინტერვალების ქვესიმრავლე-
# ებია

# (a) მიამიტი: სიჩქარით O(n
# 2
# )

# (b) სორტირებით სიჩქარით O(n log n), მეხსიერებით O(n)
# (c) ადგილზე სორტირებით სიჩქარით O(n log n), მეხსიერებით
# O(1)
# 9. მოცემული რიცხვითი მასივისთვის იპოვეთ ყველა სამეული,
# რომელთა ჯამი 0-ია.
# (a) მიამიტი ჩალაგებული ციკლებით: სიჩქარით O(n
# 3

# ), მეხსი-
# ერებით O(n)

# (b) ჰეშირებით O(n
# 2
# ), მეხსიერებით O(1)

# (c) სორტირებით სიჩქარით O(n log n), მეხსიერებით O(1)

# 10. მოცემულია არაუარყოფითი რიცხვების n სიგძის მასივი, რომ-
# ლის ელემენტები გარკვეული საქონლის ფასებია სხვადასხვა

# დღეებში. იპოვეთ მაქსიმალური მოგება, რომელიც მიიღწევა
# ერთი ყიდვით და ერთი გაყიდვით (ყიდვის შემდეგ).
# (a) მიამიტი ჩალაგებული ციკლებით: სიჩქარით O(n
# 2

# ), მეხსი-
# ერებით O(1)

# (b) ხრიკები: სიჩქარით O(n), მეხსიერებით O(1)